{"format":"layers-model","generatedBy":"keras v2.3.1","convertedBy":"TensorFlow.js Converter v1.5.2","modelTopology":{"keras_version":"2.3.1","backend":"tensorflow","model_config":{"class_name":"Model","config":{"name":"model_1","layers":[{"name":"input_1","class_name":"InputLayer","config":{"batch_input_shape":[null,256,256,3],"dtype":"float32","sparse":false,"name":"input_1"},"inbound_nodes":[]},{"name":"conv2d_1","class_name":"Conv2D","config":{"name":"conv2d_1","trainable":true,"dtype":"float32","filters":32,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["input_1",0,0,{}]]]},{"name":"max_pooling2d_1","class_name":"MaxPooling2D","config":{"name":"max_pooling2d_1","trainable":true,"dtype":"float32","pool_size":[2,2],"padding":"same","strides":[2,2],"data_format":"channels_last"},"inbound_nodes":[[["conv2d_1",0,0,{}]]]},{"name":"conv2d_2","class_name":"Conv2D","config":{"name":"conv2d_2","trainable":true,"dtype":"float32","filters":64,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["max_pooling2d_1",0,0,{}]]]},{"name":"max_pooling2d_2","class_name":"MaxPooling2D","config":{"name":"max_pooling2d_2","trainable":true,"dtype":"float32","pool_size":[2,2],"padding":"same","strides":[2,2],"data_format":"channels_last"},"inbound_nodes":[[["conv2d_2",0,0,{}]]]},{"name":"conv2d_3","class_name":"Conv2D","config":{"name":"conv2d_3","trainable":true,"dtype":"float32","filters":128,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["max_pooling2d_2",0,0,{}]]]},{"name":"max_pooling2d_3","class_name":"MaxPooling2D","config":{"name":"max_pooling2d_3","trainable":true,"dtype":"float32","pool_size":[2,2],"padding":"same","strides":[2,2],"data_format":"channels_last"},"inbound_nodes":[[["conv2d_3",0,0,{}]]]},{"name":"conv2d_4","class_name":"Conv2D","config":{"name":"conv2d_4","trainable":true,"dtype":"float32","filters":128,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["max_pooling2d_3",0,0,{}]]]},{"name":"up_sampling2d_1","class_name":"UpSampling2D","config":{"name":"up_sampling2d_1","trainable":true,"dtype":"float32","size":[2,2],"data_format":"channels_last","interpolation":"nearest"},"inbound_nodes":[[["conv2d_4",0,0,{}]]]},{"name":"conv2d_5","class_name":"Conv2D","config":{"name":"conv2d_5","trainable":true,"dtype":"float32","filters":64,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["up_sampling2d_1",0,0,{}]]]},{"name":"up_sampling2d_2","class_name":"UpSampling2D","config":{"name":"up_sampling2d_2","trainable":true,"dtype":"float32","size":[2,2],"data_format":"channels_last","interpolation":"nearest"},"inbound_nodes":[[["conv2d_5",0,0,{}]]]},{"name":"conv2d_6","class_name":"Conv2D","config":{"name":"conv2d_6","trainable":true,"dtype":"float32","filters":32,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["up_sampling2d_2",0,0,{}]]]},{"name":"up_sampling2d_3","class_name":"UpSampling2D","config":{"name":"up_sampling2d_3","trainable":true,"dtype":"float32","size":[2,2],"data_format":"channels_last","interpolation":"nearest"},"inbound_nodes":[[["conv2d_6",0,0,{}]]]},{"name":"conv2d_7","class_name":"Conv2D","config":{"name":"conv2d_7","trainable":true,"dtype":"float32","filters":3,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["up_sampling2d_3",0,0,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["conv2d_7",0,0]]}}},"weightsManifest":[{"paths":["group1-shard1of1.bin"],"weights":[{"name":"conv2d_1/kernel","shape":[3,3,3,32],"dtype":"float32","quantization":{"min":-0.14766488577805312,"scale":0.0011627156360476624,"dtype":"uint8"}},{"name":"conv2d_1/bias","shape":[32],"dtype":"float32","quantization":{"min":-0.10775970991920023,"scale":0.0007483313188833349,"dtype":"uint8"}},{"name":"conv2d_2/kernel","shape":[3,3,32,64],"dtype":"float32","quantization":{"min":-0.09200385563513812,"scale":0.0007301893304376042,"dtype":"uint8"}},{"name":"conv2d_2/bias","shape":[64],"dtype":"float32","quantization":{"min":-0.08914575833169854,"scale":0.00043065583735120064,"dtype":"uint8"}},{"name":"conv2d_3/kernel","shape":[3,3,64,128],"dtype":"float32","quantization":{"min":-0.06670257536803975,"scale":0.0005293855187939663,"dtype":"uint8"}},{"name":"conv2d_3/bias","shape":[128],"dtype":"float32","quantization":{"min":-0.09269834000105952,"scale":0.0005207771910171883,"dtype":"uint8"}},{"name":"conv2d_4/kernel","shape":[3,3,128,128],"dtype":"float32","quantization":{"min":-0.05549435466527939,"scale":0.00046633911483428056,"dtype":"uint8"}},{"name":"conv2d_4/bias","shape":[128],"dtype":"float32","quantization":{"min":-0.047801569323329365,"scale":0.0002670478733146892,"dtype":"uint8"}},{"name":"conv2d_5/kernel","shape":[3,3,128,64],"dtype":"float32","quantization":{"min":-0.06713470991920022,"scale":0.0005594559159933352,"dtype":"uint8"}},{"name":"conv2d_5/bias","shape":[64],"dtype":"float32","quantization":{"min":-0.04262385054984513,"scale":0.00022316152120337767,"dtype":"uint8"}},{"name":"conv2d_6/kernel","shape":[3,3,64,32],"dtype":"float32","quantization":{"min":-0.09486180742581685,"scale":0.0007839818795522054,"dtype":"uint8"}},{"name":"conv2d_6/bias","shape":[32],"dtype":"float32","quantization":{"min":-0.09265100379638812,"scale":0.00048508378950988545,"dtype":"uint8"}},{"name":"conv2d_7/kernel","shape":[3,3,32,3],"dtype":"float32","quantization":{"min":-0.15364756747788075,"scale":0.001259406290802301,"dtype":"uint8"}},{"name":"conv2d_7/bias","shape":[3],"dtype":"float32","quantization":{"min":0.020226038992404938,"scale":0.00011394469469201331,"dtype":"uint8"}}]}]}